{
  "en": {
    "pageTitle": "Sip 'n Spill",
    "selectLanguage": "Select Language:",
    "startGame": "Start Game",
    "gameRulesTitle": "Game Rules",
    "rules": [
      "Player one silently reads the first question to themselves.",
      "Player one then points to each player and guesses whether they have done what the question describes.",
      "After guessing for all players, player one reads the question aloud.",
      "Any player who has done what the question describes takes a sip of their drink.",
      "Player one passes the phone to the person on their right.",
      "The next player taps the screen to reveal a new question.",
      "The next player silently reads the question to themselves.",
      "Continue until all questions have been answered or you decide to stop.",
      "Most importantly: have fun and drink responsibly!"
    ],
    "footerText": "© {year} Sip 'n Spill. Created by Sindriax 🍉.",
    "restartGame": "Restart",
    "backToHome": "Home",
    "loadingQuestions": "Loading questions...",
    "noQuestionsLoaded": "No questions loaded. Please check the questions file for the selected language ({lang}).",
    "loadingSettings": "Loading settings...",
    "tapToContinue": "Tap the screen or press Space to continue.",
    "questionProgress": "Question {current} of {total}"
  },
  "es": {
    "pageTitle": "Sip 'n Spill",
    "selectLanguage": "Seleccionar Idioma:",
    "startGame": "Empezar Juego",
    "gameRulesTitle": "Reglas del Juego",
    "rules": [
      "El primer jugador lee en silencio la primera pregunta para sí mismo.",
      "Luego, el primer jugador señala a cada jugador y adivina si han hecho lo que describe la pregunta.",
      "Después de adivinar para todos los jugadores, el primer jugador lee la pregunta en voz alta.",
      "Cualquier jugador que haya hecho lo que describe la pregunta toma un sorbo de su bebida.",
      "El primer jugador pasa el teléfono a la persona a su derecha.",
      "El siguiente jugador toca la pantalla para revelar una nueva pregunta.",
      "El siguiente jugador lee en silencio la pregunta para sí mismo.",
      "Continúa hasta que todas las preguntas hayan sido respondidas o decidas parar.",
      "Lo más importante: ¡diviértete y bebe con responsabilidad!"
    ],
    "footerText": "© {year} Sip 'n Spill. Creado por Sindriax 🍉.",
    "restartGame": "Reiniciar",
    "backToHome": "Inicio",
    "loadingQuestions": "Cargando preguntas...",
    "noQuestionsLoaded": "No se cargaron preguntas. Por favor, revisa el archivo de preguntas para el idioma seleccionado ({lang}).",
    "loadingSettings": "Cargando configuración...",
    "tapToContinue": "Toca la pantalla o presiona Espacio para continuar.",
    "questionProgress": "Pregunta {current} de {total}"
  }
}
